Revit 2027 API
DatumPlane.PropagateToViews Method
 Propagates the extents applied to this datum in the view to the specified parallel views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void PropagateToViews(
	View view,
	ISet<ElementId> parallelViews
)
Public Sub PropagateToViews (
	view As View,
	parallelViews As ISet(Of ElementId)
)
public:
void PropagateToViews(
	View^ view,
	ISet<ElementId^>^ parallelViews
)
member PropagateToViews :
        view : View *
        parallelViews : ISet<ElementId> -> unit
Parameters
view View
 The view on which the DatumPlane shows.
parallelViews ISet<ElementId>
 The ids of the specified parallel views.
Exceptions
Exception | Condition
ArgumentException |  The datum plane cannot be visible in the view. -or- One ElementId in parallelViews is not valid for extent propagation.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DatumPlane Class
Autodesk.Revit.DB Namespace